fio/results/libpmem_d32.txt
libpmem-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqread: (g=2): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqwrite: (g=3): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
fio-3.6-5-gf31fe
Starting 128 processes
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
[...]

libpmem-randread: (groupid=0, jobs=32): err= 0: pid=5198: Fri Apr 20 18:18:14 2018
   read: IOPS=8344k, BW=31.8GiB/s (34.2GB/s)(955GiB/30002msec)
    clat (nsec): min=102, max=32029k, avg=3175.99, stdev=112921.95
     lat (nsec): min=129, max=32029k, avg=3247.39, stdev=114136.16
    clat percentiles (nsec):
     |  1.00th=[  836],  5.00th=[ 1272], 10.00th=[ 1512], 20.00th=[ 1800],
     | 30.00th=[ 2008], 40.00th=[ 2192], 50.00th=[ 2352], 60.00th=[ 2512],
     | 70.00th=[ 2704], 80.00th=[ 2896], 90.00th=[ 3248], 95.00th=[ 3536],
     | 99.00th=[ 4320], 99.50th=[ 4704], 99.90th=[ 5856], 99.95th=[16064],
     | 99.99th=[18560]
   bw (  KiB/s): min=406171, max=1394018, per=2.47%, avg=822910.40, stdev=219578.91, samples=1888
   iops        : min=101542, max=348504, avg=205727.22, stdev=54894.71, samples=1888
  lat (nsec)   : 250=0.08%, 500=0.21%, 750=0.41%, 1000=1.31%
  lat (usec)   : 2=27.80%, 4=68.25%, 10=1.89%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=75.00%, sys=0.00%, ctx=17596, majf=0, minf=2424
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=250325468,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-randwrite: (groupid=1, jobs=32): err= 0: pid=5239: Fri Apr 20 18:18:14 2018
  write: IOPS=6581k, BW=25.1GiB/s (26.0GB/s)(753GiB/30001msec)
    clat (nsec): min=270, max=40007k, avg=4273.35, stdev=130568.42
     lat (nsec): min=294, max=40007k, avg=4334.71, stdev=131550.07
    clat percentiles (nsec):
     |  1.00th=[ 1048],  5.00th=[ 1592], 10.00th=[ 1848], 20.00th=[ 2224],
     | 30.00th=[ 2512], 40.00th=[ 2768], 50.00th=[ 3056], 60.00th=[ 3344],
     | 70.00th=[ 3664], 80.00th=[ 4080], 90.00th=[ 4704], 95.00th=[ 5408],
     | 99.00th=[ 7008], 99.50th=[ 7712], 99.90th=[ 9280], 99.95th=[10048],
     | 99.99th=[12992]
   bw (  KiB/s): min=324026, max=1089288, per=2.56%, avg=672891.12, stdev=182170.04, samples=1888
   iops        : min=81006, max=272322, avg=168222.41, stdev=45542.52, samples=1888
  lat (nsec)   : 500=0.05%, 750=0.26%, 1000=0.54%
  lat (usec)   : 2=12.72%, 4=64.92%, 10=21.45%, 20=0.04%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=75.00%, sys=0.00%, ctx=17453, majf=0, minf=2394
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,197428762,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqread: (groupid=2, jobs=32): err= 0: pid=5274: Fri Apr 20 18:18:14 2018
   read: IOPS=8650k, BW=32.0GiB/s (35.4GB/s)(990GiB/30001msec)
    clat (nsec): min=372, max=40024k, avg=3074.75, stdev=111815.85
     lat (nsec): min=402, max=56022k, avg=3146.71, stdev=113122.93
    clat percentiles (nsec):
     |  1.00th=[  884],  5.00th=[ 1240], 10.00th=[ 1464], 20.00th=[ 1736],
     | 30.00th=[ 1928], 40.00th=[ 2096], 50.00th=[ 2256], 60.00th=[ 2416],
     | 70.00th=[ 2608], 80.00th=[ 2800], 90.00th=[ 3152], 95.00th=[ 3472],
     | 99.00th=[ 4256], 99.50th=[ 4640], 99.90th=[ 5792], 99.95th=[15936],
     | 99.99th=[18304]
   bw (  KiB/s): min=396700, max=1464444, per=2.65%, avg=916524.19, stdev=259565.17, samples=1888
   iops        : min=99175, max=366111, avg=229130.63, stdev=64891.28, samples=1888
  lat (nsec)   : 500=0.01%, 750=0.37%, 1000=1.45%
  lat (usec)   : 2=32.31%, 4=64.18%, 10=1.62%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=75.00%, sys=0.00%, ctx=17265, majf=0, minf=2380
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=259493742,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqwrite: (groupid=3, jobs=32): err= 0: pid=5306: Fri Apr 20 18:18:14 2018
  write: IOPS=6578k, BW=25.1GiB/s (26.9GB/s)(753GiB/30001msec)
    clat (nsec): min=269, max=40004k, avg=4311.84, stdev=131567.48
     lat (nsec): min=293, max=48024k, avg=4373.98, stdev=132590.41
    clat percentiles (nsec):
     |  1.00th=[ 1096],  5.00th=[ 1608], 10.00th=[ 1880], 20.00th=[ 2256],
     | 30.00th=[ 2544], 40.00th=[ 2800], 50.00th=[ 3056], 60.00th=[ 3344],
     | 70.00th=[ 3664], 80.00th=[ 4080], 90.00th=[ 4768], 95.00th=[ 5472],
     | 99.00th=[ 7072], 99.50th=[ 7776], 99.90th=[ 9408], 99.95th=[10176],
     | 99.99th=[13504]
   bw (  KiB/s): min=213200, max=1111640, per=3.12%, avg=821864.74, stdev=225451.91, samples=1888
   iops        : min=53300, max=277910, avg=205466.16, stdev=56362.98, samples=1888
  lat (nsec)   : 500=0.04%, 750=0.23%, 1000=0.47%
  lat (usec)   : 2=12.15%, 4=65.12%, 10=21.93%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=75.00%, sys=0.01%, ctx=17347, majf=0, minf=2437
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,197348132,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=31.8GiB/s (34.2GB/s), 31.8GiB/s-31.8GiB/s (34.2GB/s-34.2GB/s), io=955GiB (1025GB), run=30002-30002msec

Run status group 1 (all jobs):
  WRITE: bw=25.1GiB/s (26.0GB/s), 25.1GiB/s-25.1GiB/s (26.0GB/s-26.0GB/s), io=753GiB (809GB), run=30001-30001msec

Run status group 2 (all jobs):
   READ: bw=32.0GiB/s (35.4GB/s), 32.0GiB/s-32.0GiB/s (35.4GB/s-35.4GB/s), io=990GiB (1063GB), run=30001-30001msec

Run status group 3 (all jobs):
  WRITE: bw=25.1GiB/s (26.9GB/s), 25.1GiB/s-25.1GiB/s (26.9GB/s-26.9GB/s), io=753GiB (808GB), run=30001-30001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%